app/controllers/lists_controller.rb

  def index
    @list = List.new
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @list = List.new(list_params)
    if @list.save
      redirect_to list_url(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hi"], ["created_at", "2016-10-21 15:49:23.396888"], ["updated_at", "2016-10-21 15:49:23.396888"]]
SELECT "lists".* FROM "lists"